#-------------------------------------------------------------------------------
# Taps
#-------------------------------------------------------------------------------

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'sambadevi/powerlevel9k'
tap 'd12frosted/emacs-plus'
tap 'romkatv/powerlevel10k'

#-------------------------------------------------------------------------------
# Make sure apps get installed in system Applications dir
#-------------------------------------------------------------------------------

cask_args appdir: '/Applications'

#-------------------------------------------------------------------------------
# Install ZSH
#-------------------------------------------------------------------------------

brew 'zsh'
brew 'zsh-completions'

#-------------------------------------------------------------------------------
# Install GNU core utilities (those that come with OS X are outdated)
#-------------------------------------------------------------------------------

brew 'coreutils'

#-------------------------------------------------------------------------------
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
#-------------------------------------------------------------------------------

brew 'findutils'

#-------------------------------------------------------------------------------
# Install Bash 4
#-------------------------------------------------------------------------------

brew 'bash'

#-------------------------------------------------------------------------------
# Install Binaries
#------------------------------------------------------------------------------

brew 'ripgrep'                                   # fast search
brew 'fd'                                        # Upgrade to 'find'
brew 'sd'                                        # Upgrade to 'sed'
brew 'delta'                                     # Upgrade to 'diff'
brew 'tldr'                                      # Simplified to 'man' pages
brew 'dust'                                      # Upgrade to 'du'
brew 'exa'
brew 'graphviz'                                  # Graph visualizations
brew 'diff-so-fancy'                             # 'diff' upgrade for Git usage
brew 'bat'                                       # 'cat' upgrade
brew 'ctags'                                     # tags for Project navigation
brew 'nginx'                                     # web server
brew 'dnsmasq'                                   # lightweight DNS forwarder + DHCP server
brew 'prettyping'                                # Pretty ping (simple, colorized output)
brew 'tmux'                                      # terminal multiplexing
brew 'nvm'                                       # Node version manager
brew 'fasd'                                      # Navigation
brew 'mutt'                                      # CLI email util (for crontab)
brew 'jq'                                        # CLI JSON manipulator
brew 'fx'                                        # CLI JSON editor
brew 'cscope'                                    # Ctags complement for tagged code
brew 'direnv'
brew 'grep'
brew 'parallel'
brew 'awslogs'
brew 'awscli'
brew 'git'
brew 'git-flow'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'node', args: ['with-npm']
brew 'openssl'
brew 'tcpdump'
brew 'tree'
brew 'wget'
brew 'fzf'
brew 'cmake'
brew 'hexyl'                                        # Better 'xxd' (hex code viewer)
brew 'neovim'                                       # Better 'vim'
brew 'zlib'
brew 'powerlevel9k'				                    # zsh shell powerline
brew 'git-recent'                                   # viewing latest git branches
brew 'broot'                                        # broot - tree,cd,fuzzy-search
brew 'chrome-cli'
brew 'act' # local Github Actions (GHA) runner (using docker)

brew 'sbcl'
brew 'terraform@0.11'
brew 'terraform-ls' # Used for VSCode IDE terraform plugin to do Goto Symbol + etc.
brew 'pip'
brew 'pip3'
brew 'poetry'
brew 'kube-ps1'
brew 'kops'
brew 'ksh'
brew 'emacs-plus'
brew 'cfr-decompiler'
brew 'git-recent'
brew 'zola'
brew 'httrack' # website download / mirror tool
brew 'ngrok' # ingress-as-a-service (easiest way to expose localhost to public internet)
brew 'gh' # github cli

#-------------------------------------------------------------------------------
# Development-Ruby
#-------------------------------------------------------------------------------

brew 'ruby'
brew 'rbenv'

#-------------------------------------------------------------------------------
# Development-Python (includes pip, easy_install)
# ... Also jupyter for jupyter notebook
#-------------------------------------------------------------------------------

brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'jupyter'

#-------------------------------------------------------------------------------
# Development-Go
#-------------------------------------------------------------------------------

brew 'golang'

#-------------------------------------------------------------------------------
# Development-Java
#-------------------------------------------------------------------------------

cask 'java'
brew 'gradle'
brew 'kotlin'
brew 'maven'

#-------------------------------------------------------------------------------
# Databases
#-------------------------------------------------------------------------------

brew 'mysql'
brew 'postgresql'                                # DBMS
brew 'sqlite'

#-------------------------------------------------------------------------------
# Apps
#-------------------------------------------------------------------------------

cask 'visual-studio-code'
cask 'spotify'
cask 'fantastical'
cask 'anaconda'
cask 'docker'
cask 'iterm2'
cask 'psequel'
cask 'rdm'
cask 'sublime-text'
cask 'wireshark'
cask 'alfred'
cask 'istat-menus'
cask 'slack'
cask 'postman'
cask 'flux'
cask 'dropbox'
cask 'zoom'
cask 'zotero'
cask 'pdf-expert'
cask 'monitorcontrol'

#-------------------------------------------------------------------------------
# Fonts
#-------------------------------------------------------------------------------

cask 'caskroom/fonts/font-hack-nerd-font'
